In [1]:
import pandas as pd
import numpy as np
import scipy as sp

import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

%matplotlib inline
%precision 3

'%.3f'

In [16]:
train = pd.read_csv('C:/Users/KIHyuk/Desktop/dacon_data/Data_상점매출/train.csv')

In [17]:
# 2016-08-01부터 2018-07-31까지.
train.head()

,store_id,date,time,card_id,amount,installments,days_of_week,holyday
0,0,2016-12-14,18:05:31,d297bba73f,5,NaN,2,0
1,0,2016-12-14,18:05:54,d297bba73f,-5,NaN,2,0
2,0,2016-12-19,12:42:31,0880849c05,144,NaN,0,0
3,0,2016-12-19,12:48:08,8b4f9e0e95,66,NaN,0,0
4,0,2016-12-19,13:31:08,7ad237eed0,24,NaN,0,0

In [18]:
train.shape

(3362796, 8)

In [19]:
train.dtypes

store_id          int64
date             object
time             object
card_id          object
amount            int64
installments    float64
days_of_week      int64
holyday           int64
dtype: object

In [9]:
train['store_id'] # 총 1799개의 상점

0             0
1             0
2             0
3             0
4             0
           ...
3362791    1799
3362792    1799
3362793    1799
3362794    1799
3362795    1799
Name: store_id, Length: 3362796, dtype: int64

In [14]:
# date,time => python datetime 형식으로 변경

train['datetime'] = train['date'] + train['time']

# train['date'] = train['date'].apply(pd.to_datetime)

In [ ]:
train